Presentation/SetText.AppService.Tests/TestResources/Save.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"
            xmlns:o="http://tempuri.org/"
            xmlns:vm="http://schemas.datacontract.org/2004/07/JJ.Presentation.SaveText.Interface.ViewModels"
            xmlns:c="http://schemas.datacontract.org/2004/07/JJ.Business.CanonicalModel">
  <s:Header/>
  <s:Body>
    <o:Save>
      <o:viewModel>
        <vm:SyncSuccessfulMessageVisible>false</vm:SyncSuccessfulMessageVisible>
        <vm:Text>Hi</vm:Text>
        <vm:TextWasSavedButNotYetSynchronized>false</vm:TextWasSavedButNotYetSynchronized>
        <vm:TextWasSavedMessageVisible>false</vm:TextWasSavedMessageVisible>
      </o:viewModel>
      <o:cultureName>nl-NL</o:cultureName>
    </o:Save>
  </s:Body>
</s:Envelope>